Repository: saidakbar118/BigBenEdu
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: BIZ HAQIMIZDA
ru: О НАС

source: YO'NALISHLARIMIZ
ru: НАПРАВЛЕНИЯ

source: HIKOYAMIZ
ru: НАША ИСТОРИЯ

source: BIZNING JAMOA
ru: НАША КОМАНДА

source: MA'LUMOT
ru: ИНФОРМАЦИЯ

source: Aloqa
ru: КОНТАКТЫ

source: SHOP
ru: МАГАЗИН

source: Welcome to Big Ben
ru: BigBen ждёт вас

source: BATAFSIL
ru: Подробнее

source: Ta’lim // Mas’uliyat // Mustaqil fikr
ru: Обучение // Ответственность // Самостоятельное мышление

source: YO'NALISHLAR
ru: НАПРАВЛЕНИЯ

source: Yo'nalishlar bilan tanishib chiqing
ru: Ознакомьтесь с направлениями

source: Biz haqimizda ko'proq bilib oling.
ru: Узнайте о нас больше.

source: Be Part
ru: Станьте

source: Of Our
ru: Частью

source: Story!
ru: Истории!

source: Big Ben team family
ru: Семья BigBen

source: Bizning jamoa - Bizning oila.
ru: Наша команда — наша семья.

source: Hurulbaev Sarvar
ru: Хурулбаев Сарвар

source: Head Teacher, Language Instructor
ru: Старший преподаватель, преподаватель языка

source: Zuhra
ru: Зухра

source: English language instructor
ru: Преподаватель английского языка

source: Akbarova
ru: Хадиджа Акбарова

source: G'anijonova
ru: Мехридил Ганижонова

source: Biz haqimizda yana biroz
ru: Немного о нас

source: The Story of Sava Hurulbaev
ru: История Савы Хурулбаева

source: I See Myself as a Social Entrepreneur
ru: Я вижу себя социальным предпринимателем

source: Laying the Foundations: Big Ben Education Hub
ru: Закладывая фундамент: образовательный центр Big Ben

source: Scaling Impact: EU Project in Fergana Valley
ru: Масштабирование воздействия: проект ЕС в Ферганской долине

source: Learning and Bringing Back: From Andijan to Austin
ru: Обучение и возвращение: от Андижана до Остина

source: Chevening Scholar: From London to Local Action
ru: Chevening Scholar: от Лондона к местным действиям

source: Andijan Business Leaders Program: Multiplying Change
ru: Программа «Андижанские бизнес-лидеры»: умножение изменений

source: My Philosophy: Change Takes Steps
ru: Моя философия: перемены требуют шагов

source: Yopish
ru: Закрыть

source: My mission has always been to fill the gaps my community faces day to day — gaps in education, in leadership, in opportunity. Where some see problems, I see possibilities. Entrepreneurs are best positioned to solve community challenges because they are trained to recognize problems not as obstacles, but as opportunities for innovation. Once equipped with the right knowledge and global perspective, they can bring the world back into their communities — inspiring, motivating, and driving real change.
ru: Моя миссия всегда заключалась в том, чтобы восполнять пробелы, с которыми ежедневно сталкивается моё сообщество — пробелы в образовании, в лидерстве, в возможностях. Там, где одни видят проблемы, я вижу возможности. Именно предприниматели лучше всего способны решать вызовы общества, ведь они привыкли воспринимать трудности не как препятствия, а как возможности для инноваций. Получив необходимые знания и глобальное видение, они могут возвращать опыт в свои сообщества — вдохновляя, мотивируя и создавая реальные перемены.

source: In 2020, I established Big Ben Education Hub with a bold vision: to give young people access to quality education and the confidence to participate in shaping their futures. Despite the challenges of the time, within the very first year we welcomed over 400 students. This success demonstrated not only the demand for such a space, but also the power of education as a springboard for transformation.
ru: В 2020 году я основал Big Ben Education Hub с амбициозной целью: дать молодым людям доступ к качественному образованию и уверенность в том, что они могут участвовать в формировании своего будущего. Несмотря на трудности того времени, уже в первый год мы приняли более 400 студентов. Этот успех показал не только высокий спрос на подобное пространство, но и силу образования как трамплина для преобразований.

source: Soon after, I was invited to serve as Project Manager for one of the largest EU-funded initiatives in Uzbekistan’s Fergana Valley. With a budget of €329,000, my role was to design and deliver 12 youth-led mini-projects across Andijan, Asaka, and seven neighborhoods. For two years, I worked closely with young leaders, training them to engage in local decision-making and ensuring their voices were heard. Watching these young people grow into active changemakers convinced me that empowered communities are built by empowered individuals.
ru: Вскоре после этого меня пригласили на должность руководителя проекта в рамках одной из крупнейших инициатив, финансируемых ЕС, в Ферганской долине Узбекистана. Бюджет проекта составлял 329 000 евро. Моя задача заключалась в разработке и реализации 12 мини-проектов, реализуемых под руководством молодёжи, в Андижане, Асаке и семи районах. В течение двух лет я тесно сотрудничал с молодыми лидерами, обучая их участию в принятии решений на местном уровне и добиваясь того, чтобы их голоса были услышаны. Наблюдая за тем, как эти молодые люди превращаются в активных деятелей перемен, я убедился, что сильные сообщества создаются сильными людьми.

source: In 2022, I was selected for the Uzbekistan Business Leaders (UBL) Program, funded by the American Councils. Out of 300 applicants, I was chosen as one of the finalists. This fellowship took me to Austin, Texas, where I immersed myself in entrepreneurial sessions at the University of Texas. I saw firsthand how American entrepreneurs innovate, collaborate, and solve problems at scale. Upon returning, I launched the Andijan Business Club, gathering over 60 entrepreneurs. Together with local universities, we created a platform where business leaders shared real-life cases with students, while identifying and nurturing new talent. This became a powerful bridge between education and entrepreneurship.
ru: В 2022 году меня отобрали для участия в программе «Бизнес-лидеры Узбекистана» (UBL), финансируемой Американскими советами. Из 300 претендентов я вошёл в число финалистов. Эта стипендия привела меня в Остин, штат Техас, где я погрузился в предпринимательские занятия в Техасском университете. Я своими глазами увидел, как американские предприниматели внедряют инновации, сотрудничают и решают проблемы в масштабах. Вернувшись, я основал Андижанский бизнес-клуб, объединивший более 60 предпринимателей. Совместно с местными университетами мы создали платформу, где бизнес-лидеры делились реальными примерами со студентами, выявляя и развивая новые таланты. Это стало мощным связующим звеном между образованием и предпринимательством.

source: In 2023, I was awarded the Chevening Scholarship — one of the most prestigious UK Government awards. Only 1–2% of all applicants worldwide succeed, and I was honored to be among them. Through Chevening, I completed my Master’s in Entrepreneurship, Innovation, and Enterprise Development in London (2023–2024). But my ambition was never just to study — I wanted to act. Returning to Uzbekistan, I opened the second branch of Big Ben Education Hub, which became more than a learning center. It is now a hybrid ecosystem: - A coworking space for entrepreneurs A training hub for English teachers to grow skills and income - A networking zone for students and business leaders to connect, collaborate, and create opportunities together This reflects my philosophy: education and entrepreneurship together are the engines of social change.
ru: В 2023 году мне была присуждена стипендия Chevening — одна из самых престижных наград правительства Великобритании. Только 1–2% всех претендентов по всему миру получают стипендию, и мне выпала честь оказаться в их числе. Благодаря Chevening я получил степень магистра предпринимательства, инноваций и развития предприятий в Лондоне (2023–2024). Но моей целью было не просто учиться — я хотел действовать. Вернувшись в Узбекистан, я открыл второй филиал Big Ben Education Hub, который стал больше, чем просто учебным центром. Теперь это гибридная экосистема: — коворкинг для предпринимателей; учебный центр для преподавателей английского языка, где они могут развивать навыки и увеличивать доход; — зона нетворкинга для студентов и бизнес-лидеров, где можно общаться, сотрудничать и совместно создавать возможности. Это отражает мою философию: образование и предпринимательство вместе являются двигателями социальных изменений.

source: Inspired by my U.S. experience, I launched the Andijan Business Leaders Program. Unlike programs that target students alone, this initiative empowers young entrepreneurs who each employ 40+ people across industries such as pharmaceuticals, textiles, IT, hospitality, education, furniture, and real estate. - In 2024 and 2025, I led 20 entrepreneurs on 10-day leadership journeys in London. These were not just trips — they were accelerators. Participants returned with global best practices, stronger networks, and fresh strategies to apply in their businesses and communities. - In 2026, I will take 10 outstanding entrepreneurs to the United States, connecting Andijan’s leaders with global markets and networks. This multiplies their ability to improve industries, generate jobs, and solve pressing community challenges.
ru: Вдохновлённый своим опытом в США, я запустил программу «Андижанские бизнес-лидеры». В отличие от программ, ориентированных только на студентов, эта инициатива расширяет возможности молодых предпринимателей, каждый из которых нанимает более 40 человек в сферах фармацевтики, текстиля, IT, гостиничного бизнеса, образования, мебельной промышленности и недвижимости. — В 2024 и 2025 годах я провёл 20 предпринимателей в 10-дневные лидерские поездки в Лондон. Это были не просто поездки — это были акселераторы. Участники вернулись с глобальными лучшими практиками, расширенными связями и новыми стратегиями для применения в своём бизнесе и сообществах. — В 2026 году я планирую отправить 10 выдающихся предпринимателей в Соединённые Штаты, чтобы подключить лидеров Андижана к глобальным рынкам и сетям. Это умножит их возможности по улучшению отраслей, созданию рабочих мест и решению насущных проблем сообщества.

source: Real change does not happen overnight. It requires influence, impact, and persistence. 1. Influence minds with education and exposure. 2. Affect systems through leadership and collaboration. 3. Create impact that transforms communities and industries. Every project I lead — in education, entrepreneurship, or leadership development — follows this process. By educating and empowering entrepreneurs, I am building the capacity of those who can solve the most pressing challenges our communities face. I believe the future of Andijan, and Uzbekistan as a whole, lies in its entrepreneurs — educated, globally aware, and locally committed. They are the ones who will see every problem as an opportunity and transform challenges into stepping stones toward progress.
ru: Настоящие изменения не происходят в одночасье. Они требуют влияния, воздействия и настойчивости. 1. Влиять на умы через образование и знакомство с миром. 2. Влиять на системы через лидерство и сотрудничество. 3. Создавать воздействие, которое преобразует сообщества и отрасли. Каждый проект, который я веду — в сферах образования, предпринимательства или развития лидерских качеств — следует этому процессу. Обучая и расширяя возможности предпринимателей, я повышаю потенциал тех, кто может решить самые насущные проблемы наших сообществ. Я верю, что будущее Андижана и всего Узбекистана связано с предпринимателями — образованными, глобально осведомлёнными и преданными своему делу. Именно они будут видеть в каждой проблеме возможность и превращать вызовы в шаги к прогрессу.

source: Biz bilan bog'laning
ru: Связаться с нами

source: Aloqaga chiqing va BigBen a'zosiga aylaning
ru: Свяжитесь с нами и станьте членом BigBen
